整体性学习基于三种主要观点：
（1）结构
（2）模型
（3）高速公路

整体性学习的基础就是将知识关联起来以达到记忆和应用知识的目的，开始学习
的最佳技术是比喻、内在化、基于流程的记事和画图表法，这些方法构成了整体性学
习的基础。

建立良好的知识结构就是绘制一份优秀的地图.所以
建立知识结构时，你的目标就是在各种知识之间建立尽可能多的联系，聪明的人会很自然
地这么做，每学习一个新概念，都会自动地与其他知识相联系。

模型是简化的结构. 模型有很多种形式，但是目标总是同样的：那就是压缩信息。通过将一些核心概念
联系在一起，就可以创建一个模型。模型对于你开始构建一个结构或是在当前结构上添加
内容非常重要。

整体性学习的顺序：
（1）获取:快速阅读(指读法,练习阅读法),笔记流
（2）理解:比喻,内在化,图表法
（3）拓展:实际应用,模型纠错,以项目为基础的学习
（4）纠错
（5）应用
还有一个测试步骤是伴随上述每一步的。测试就是观察以上五个步骤做得好不好，严
格的测试能发现问题出在哪里。

获取信息时有三个主要目标：
（1）简化
（2）容量
（3）速度

信息类型
·随意信息
	假如存在某种逻辑关系，那么尽量去发现它，否则记忆和使用信息的工作会更加困难.如果这样做还是不能令人满意，可以采取下面三种方法:联想法,挂钩法,压缩法
·观点信息
	观点信息是存在争论的信息.最大的难点在于获取阶段。你需要检查大量的信息以寻找其中的模
式，而不是去记忆具体的细节。速读技巧对于收集信息非常重要.图表法对于观点来说也是非常有用的方法，它能帮助你在阅读以后提取出关键思想
·过程信息
	过程信息是教导你怎么行动的信息. 学习这类信息最重要的是不断练习、反复去做。不过，建立正确的背景概念对于节约时间也同样关键
	大多数过程信息都依赖于正确的模型，通过练习可以慢慢形成一个结构，如果有正确的模型则可以提高学习速度，以下是一些可以改进模型的技术：·内在化·比喻法·图表法·模型纠错
·具体信息
	
·抽象信息

智力挑战1
1.买一两本内容适合做快速阅读练习的书。
2.确保至3周内每天15分钟进行阅读速度和理解力的练习（具体方法见“练习阅读”一
节）。
3.练习指读法两周。
4.每周练习1次积极阅读。

智力挑战2
本次智力挑战的目的是在决定是否用笔记流取代传统记笔记方法之前，练习笔记流技
术。
1.买一本专门的笔记本，在封面上写下“笔记流技术练习本”。
2.确保2周内每天练习1次：把你课堂上记的笔记拿出来，按照笔记流的方式重新记
录，记下知识点并在知识点之间画上联系。
3.练习将其他技术融合到笔记流技术中。

智力挑战3
本次智力挑战在于提高你运用比喻法理解和记忆抽象信息的能力。
1.坚持至少两周内每天一次好好阅读学习内容，阅读完教材或笔记后，写下至少五个
主要观点。
2.针对每个观点，写一个可以解释观点的比喻。
3.假如比喻不能完全解释观点，尝试寻找更多可以解释观点的比喻。
4.应用10岁规则。是否能用这个比喻解释给一个10岁的小孩听？假如你的比喻还是和
原始观点一样，孩子听不懂。重新来过吧，直到你找到简单的他能明白的比喻。
5.针对其他观点，重复上述过程，直到你确定自己真正理解为止。

智力挑战4
本项智力挑战的目的是锻炼你形成图像以及给图像加上各种不同感觉的能力。
1.取一张白纸和铅笔，准备作画。
2.打开课本，找两个概念或观点，如果你不太熟悉内在化，建议你选择容易想象出图
像的概念先试一试。完全抽象的概念或者过于复杂的概念对于初学者来说不太适合。
3.在脑海中建立图像，将感觉和情感加上去。
4.根据脑海中所想，快速画出概念的图像来（30～60秒）。
5.坚持两周每天选几个概念练习内在化过程。

